LeeNX/ESP32-BLE-Gamepad/BleGamepad.cpp
/*
    //NimBLEService *pService = pServer->getServiceByUUID(SERVICE_UUID_UART);
    //NimBLEService* pUartService = pServer->createService(SERVICE_UUID_UART));

    //NimBLEService *pService = pServer->getServiceByUUID(SERVICE_UUID_DEVICE_INFORMATION);

    //NimBLEService *pUartService = pServer->createService(SERVICE_UUID_UART);

    BLEService* pUartService = pServer->createService(SERVICE_UUID_UART);

    BLECharacteristic* pCharacteristic_UART_TX = pUartService->createCharacteristic(
        CHARACTERISTIC_UUID_UART_TX,
        //NIMBLE_PROPERTY::READ |
        NIMBLE_PROPERTY::NOTIFY
    );

    pCharacteristic_UART_TX->setValue("TX");
    //pCharacteristic_UART_TX->setCallbacks(&chrCallbacks);

    BLECharacteristic* pCharacteristic_UART_RX = pUartService->createCharacteristic(
        CHARACTERISTIC_UUID_UART_RX,
        NIMBLE_PROPERTY::WRITE
    );

    //pCharacteristic_UART_RX->addDescriptor(new BLE2902());
    //pCharacteristic_UART_RX->addDescriptor(new BLE2902());
*/

    NimBLEDevice::setSecurityAuth(BLE_SM_PAIR_AUTHREQ_BOND);

    uint8_t *customHidReportDescriptor = new uint8_t[hidReportDescriptorSize];
    memcpy(customHidReportDescriptor, tempHidReportDescriptor, hidReportDescriptorSize);

    // Testing
    //for (int i = 0; i < hidReportDescriptorSize; i++)
    //    Serial.printf("%02x", customHidReportDescriptor[i]);

    BleGamepadInstance->hid->reportMap((uint8_t *)customHidReportDescriptor, hidReportDescriptorSize);
    BleGamepadInstance->hid->startServices();

    BleGamepadInstance->onStarted(pServer);

    NimBLEAdvertising *pAdvertising = pServer->getAdvertising();
    pAdvertising->setAppearance(HID_GAMEPAD);
    pAdvertising->addServiceUUID(BleGamepadInstance->hid->hidService()->getUUID());
    pAdvertising->addServiceUUID(SERVICE_UUID_UART);

    pAdvertising->start();
    BleGamepadInstance->hid->setBatteryLevel(BleGamepadInstance->batteryLevel);

    ESP_LOGD(LOG_TAG, "Advertising started!");
    vTaskDelay(portMAX_DELAY); // delay(portMAX_DELAY);
}
